load-test.yml
config:
  target: http://localhost:9876
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase 
  plugins:
    expect: {}      
scenarios:
  - flow:
      - get:
          url: "/authenticate"
          qs:
            username: smith
            password: smith
          capture:
            - json: $.sessionToken
              as: "sessionToken"
          expect:
            - statusCode: 200 
            - contentType: "json"
            - equals:
                - '{"userId":"user_smith","sessionToken":"{{ sessionToken }}"}'
          
  - flow:
      - get:
          url: "/authenticate"
          qs:
            username: john
            password: smith
          expect:
            - statusCode: 401
            - contentType: "text/plain; charset=utf-8"
            - equals:
                - '401 Unauthorized'

  - flow:
      - get:
          url: "/session/keep-alive"
          qs:
              sessionToken: "{{ sessionToken }}"
          expect:
            - statusCode: 401
            - contentType: "text/plain; charset=utf-8"
            - equals:
                - '401 Unauthorized'

  - flow:
      - get:
          url: "/authenticate"
          qs:
            username: smith
            password: smith
          capture:
            - json: $.sessionToken
              as: "sessionToken"
      - get:
          url: "/session/keep-alive"
          qs:
              sessionToken: "{{ sessionToken }}"
          expect:
            - statusCode: 200
            - contentType: "json"
            - equals:
                - '{"sessionToken":"{{ sessionToken }}"}'

  - flow:
      - get:
          url: "/authenticate"
          qs:
            username: john
            password: smith
          capture:
            - json: $.sessionToken
              as: "sessionToken"
      - get:
          url: "/session/keep-alive"
          qs:
              sessionToken: "{{ sessionToken }}"
          expect:
            - statusCode: 401
            - contentType: "text/plain; charset=utf-8"
            - equals:
                - '401 Unauthorized'

  - flow:
      - get:
          url: "/authenticate"
          qs:
            username: smith
            password: smith
          capture:
            - json: $.sessionToken
              as: "sessionToken"
      - get:
          url: "/session/keep-alive"
          qs:
              sessionToken: "wrong token"
          expect:
            - statusCode: 401
            - contentType: "text/plain; charset=utf-8"
            - equals:
                - '401 Unauthorized'